backend/models/Article.php

SELECT * FROM `feehi_article_content` WHERE `aid`='34'
INSERT INTO `feehi_article_content` (`aid`, `content`) VALUES ('36', '<p>1、保留好一切单据，发票，合同</p>')
---
    public function afterSave($insert, $changedAttributes)
    {
        $articleMetaTag = new ArticleMetaTag();
        $articleMetaTag->setArticleTags($this->id, $this->tag);
        if ( $insert ) {
            $contentModel = yii::createObject( ArticleContent::className() );
            $contentModel->aid = $this->id;
        } else {
            if ( $this->content === null ) {
                return true;
            }
            $contentModel = ArticleContent::findOne(['aid' => $this->id]);
            if ($contentModel == null) {
                $contentModel = yii::createObject( ArticleContent::className() );

SELECT * FROM `feehi_article_content` WHERE `aid`='39'
---
    public function afterFind()
    {
        $this->tag = call_user_func(function(){
            $tags = '';
            foreach ($this->articleTags as $tag) {
                $tags .= $tag->value . ',';
            }
            return rtrim($tags, ',');
        });
        $this->content = ArticleContent::findOne(['aid' => $this->id])['content'];